to/tldr.org
#+OPTIONS: toc:nil
#+OPTIONS: num:nil
#+LATEX_HEADER: \usepackage{geometry}\geometry{a4paper,left=15mm,right=20mm,top=20mm,bottom=30mm}
#+LATEX_HEADER: \newcommand{\R}{\mathbb{R}} 
#+LATEX_HEADER: \usepackage{extarrows} \usepackage{mathtools} \usepackage[utf8]{inputenc}\usepackage[T2A]{fontenc}

* usefull
 - ineg cauchy-bunyakovski-schwarz
  #+begin_export latex
  \[
  | \langle u, v\rangle | \leq \| u\| \|v\|
  \]
  #+end_export
 - Weierstraß:\\
  continua pe compact \(\implies \) marginită și-și atinge marginile
 - crit sylvester:
  - daca minorii principali sunt pozitivi at mat e pozitiv semidefinita
  - daca minorii principali sunt \(-, +, -,\cdots\) at mat e negativ semidefinita
 - fcț coercivă - "grows rapidly" -  \(\lim\limits_{\|x\|\to \infty} f(x) = \infty\)
  - \( -\frac{1}{2} (x^2+y^2) \leq - xy \)
  -  see this https://math.stackexchange.com/questions/1426897/

 # - \(L^p\) - funcții care ridicate la puterea $p$ sunt integrabile
   # \(L(\R^p, \R) \) se poate identifica cu \(\R^p\)
* fct distanta: 
   - def \(d(A, x) = \inf\limits_{a\in A} \| a-x\| \)
   - \(d(A, x) \iff x \in \overline{A}\)
   - \(d_A(x) = d(A, x) \) lipschitz 
   - daca \(A\) închisă \exists \( a_x\)
   - daca \(A\) închisă și convexa \(\implies\) $a_x$ unic și caracterizat de  \(\langle x-a_x, u-a_x \rangle \leq 0,\quad \forall u \in A \)

* multimi convexe
 - def: \(\forall x, y \in C, [x,y] \subseteq C \) 
 - usually
\[ \text{conv} A = \left\{ \sum_{i=1}^{?} \alpha_i x_i \bigg| \sum \alpha_i = 1, \alpha_i > 0, x_i \in A \right\} \]
 - Carathéodory: 
\[ \mathbb{R}^p \supseteq \text{conv} A = \left\{ \sum_{i=1}^{p+1} \alpha_i x_i \bigg| \sum \alpha_i = 1, 
\alpha_i > 0, x_i \in A \right\} \]
 - Hermite-Hadamard - dacă \(f\) convex:
 \[ f\left(\frac{a+b}{2}\right)\leq \frac{1}{b-a} \int_a^b f(x)dx \leq \frac{f(a)+f(b)}{2} \]
* fct convexe
 - def convexitate: \(f\) convexă pe $D$ \(\iff\)
 \[f(\lambda x + (1-\lambda)y) \leq \lambda f(x) + (1-\lambda) f(y), \forall x, y \in D,~\forall \lambda \in [0, 1]. \]
 - ineg Jensen - good stuff
 \[f\left(\sum \alpha_i x_i \right) \leq \sum \alpha_i f(x_i),~ \sum \alpha_i = 1, \alpha_i > 0, x_i \in A \]
 - ineg pantelor - pg15
 \[\frac{f(x_2) - f(x_1)}{x_2 - x_1} \leq 
   \frac{f(x_3) - f(x_1)}{x_3 - x_1} \leq
   \frac{f(x_3) - f(x_2)}{x_3 - x_2} \]
 - strict convexa \(\iff f'\) strict crescatoare \(\iff f'' >0 \iff\) def cu \( \neq\)
 - pt mai multe variabile e:
 \[ \nabla^2 f(x) (y,y) > 0,\quad \forall x\in D,y\in \mathbb{R}^p \]
* conuri pg 24
 - def: \( \forall k \in K, \lambda \ge 0,\quad  \lambda k \in K \)
 - con convex: \(C+C=C\)
 - înfăsurătoarea conică: \( \text{con }A = [0, \infty) A \coloneqq \{ \alpha a \mid \alpha>0, a\in A  \} \)
 - polara \( S^- = \{ u \in \R^p \mid \langle u, x \rangle \leq 0, \forall x \in S \} \) 
 - con inchis și convex\(\implies\) \( C= (C^-)^-\) 

* vector tangent la o mulțime 
 - def: \(u \in \R^p\) tg la \(M\) în \(\bar{x} \in \text{cl }M  \iff \exists (t_n) \xlongrightarrow{>0} 0, \) și
  \(u_n\to u\) aî \(\forall n\) 
 \[\bar{x} + t_n u_n \in M \]
 - conul tangent (închis): \(T_M(\bar{x})\)
 - conul normal: \(N_M(\bar{x}) := \left(T_M(\bar{x}) \right)^-\)
* lema Farkas - pg 28
 - avem \(n \in \mathbb{N} \) fixat
 - fie \((\varphi_i)_i \subset L(\R^p, \R)\) și \(\varphi \in L(\R^p, \R)\) at:
  #+begin_export latex
 
   \[\Big([\varphi_i(x) \leq 0 ] \implies \varphi(x) = 0\Big) \iff \exists (\alpha_i)\geq 0 
  \text{ aî } \varphi = \sum_i \alpha_i \varphi_i \]
  #+end_export
 - corolar: fie \((a_i)_i \subset \R^p\) și \(a \in \R^p\) at:
  #+begin_export latex
   \[ \Big( \forall x \in \R^p :  [\langle a_i, x \rangle \leq 0 ] \implies \langle a, x \rangle = 0\Big) \iff 
   \exists (\alpha_i)\geq 0 \text{ aî } a = \sum_i \alpha_i a_i \]
  #+end_export
* acutual minimization problems:
 - Weierstraß - pg 38: continua pe compact \( \implies\) pb minimizarii si a maximizarii au sol globale
 - Condiția necesara de ordinul I:
  \(\bar{x}\) sol locala și \(f\) diferentiabilă at \(\nabla f(\bar{x})(u) \geq 0 \forall, ~
   u \in T_M(\bar{x})\) 
 - Condiția necesara de ordinul II (\(D\) deschisă):\\
  \(\bar{x}\) min local și \(f\) diferentiabilă at \(\nabla f(\bar{x})) = 0\) și 
   \(\nabla^2 f(\bar{x})) \) pozitiv semidefinită
 - pt fct convexe min local \(\iff\) min global \(\iff \) pct critic (\(\nabla f(\bar{x})) = 0\) )

* Karush-Kuhn-Tucker
 - pct fezabile:
  \[ M := \left\{ x \in U \mid g(x) \leq 0, h(x) = 0 \right\} \]
 - indici restrictii active:
  \[ A(\bar{x}) = \left\{ i \in 1..n \mid g_i (\bar{x}) = 0  \right\} \]
 - other stuff:
  #+begin_export latex
  \[ G (\bar{x}) = \left\{
\sum_{i \in A(\bar{x})} \lambda_i \nabla g_i(\bar{x}) + \sum_{j =1}^{m} \mu_j \nabla h_j (\bar{x}) \mid 
 \lambda_i \ge 0, \mu_j \in \R
 \right\} = D(\bar{x})^- \]
  \[
  D(\bar{x}) = \left\{ u \in \R^p ~ \Big |~ \begin{matrix} 
  \nabla g_i(\bar{x})(u) \leq 0, \forall i \in A(\bar{x}) \\
  \nabla h_j(\bar{x})(u) = 0, \forall j \in 1..m
\end{matrix}
\right\}
  \]
 - thing: \( T_M(\bar{x}) \subseteq D(\bar{x}) \)
  #+end_export
 - lagrangianul:
   #+begin_export latex
   \[
   L(x, (\lambda, \mu)) := f(x) + \sum_{i=1}^n \lambda_i g_i(x) + \sum_{j=1}^m \mu_j h_j(x)
   \]
   #+end_export
   \(\bar{x}\)  sol problemei \(\implies \exists \lambda_i \geq 0, \mu \) aî \( \nabla_x L(\bar{x}, (\lambda, \mu)) = 0\) și
    \(\lambda_i g_i(\bar{x}) = 0\)

* mafs:
** pct min/max global/local
 1. cautam pct stationare \(\nabla f = 0\)
 2. calculam \(\nabla^2 f\) în pct stationare
 3. daca nu mer'e verificăm semnul lui \(f(x, y) - f(x_A, y_A)\) și gasim niște șiruri > 0 și < 0
** min/max cu restricții
 1. existenta solutiilor:  \( M = \left\{x \mid h(x) = 0, g(x) \leq 0 \right \} \)
  - dacă M compact (închisă, mărginită) \(\xLongrightarrow{\text{Weierstraß}} \exists \) sol
  - dacă M nemărginită, ne gândim dacă \(f\) coercivă \( \Big( \lim\limits_{\|x\|\to \infty} f(x) = \infty \Big)  \)\\
    \(f\) coercivă \(\implies \exists\) sol
 2. verificare cond de calificare pt pct fezabil \(\bar{x}\):\\
    #+begin_export latex
    Guignard: \(T_M(\bar{x})^- = D(\bar{x})^- \)\\
    \(~\quad \Uparrow\)

    cvasiregularitate: \(T_M(\bar{x}) = D(\bar{x}) \)\\
    \(~\quad \Uparrow\)

    liniară independență: mulțimea \(
    \{ \nabla g_i (\bar{x}) \mid i \in A(\bar{x}) \} \cup
    \{ \nabla h_j (\bar{x}) \mid j \in i..m \} \) l.i. \\
    \(~\quad \Uparrow\)

    Mangasarian-Fromovitz: \( \{ \nabla h_j (\bar{x}) \mid j \in i..m \} \) l.i. și 
    \(\exists u \in \R^p \) aî
    \[\nabla h_j (\bar{x})(u) > 0 \text{ și } \nabla g_i(\bar{x})(u) < 0,\quad \forall i \in A(\bar{x}) \]

     \(g_i, h_j\) afine - конец
     \medskip

     Slater: \( h\) afină, \(f, g_i\) convexe și 
    \(\exists u \in \R^p \) aî
    \[ h(u) = 0 \text{ și } g_i(u) < 0, \quad \forall i \in 1..n \]
    #+end_export
 3. conditii K-K-T:\\
    rezolvam sistemul:
    #+begin_export latex
    \[
    \begin{dcases}
    \nabla f(x) + \sum_{i=1}^n \lambda_i \nabla  g_i(x) + \sum_{j=1}^m \mu_j \nabla  h_j(x) = 0,\\
    h(u) = 0,\\
    \lambda_i g_i(\bar{x}) = 0, \quad \forall i \in 1..n,\\
    \lambda_i \geq 0.
    \end{dcases}
    \]
    #+end_export

* algoritmi
  - \(f\) contracție \(\iff\)  \(|f'(x)| < \lambda,\quad \lambda \in (0, 1) \) \( \iff\)
    \( \| f(x) - f(y) \| \leq \lambda \| x - y\|, \quad \lambda \in (0, 1) \) 
  - \(f\) contracție \(\implies f\) cont
  - approximari cu th Banach:
    - \( | x_n - \bar{x}| \leq | x_1 - x_0 | \dfrac{\lambda^n}{1-\lambda} \)
    - \( | x_n - \bar{x}| \leq | x_n - x_{n-1} | \dfrac{\lambda}{1-\lambda}\)
    - \( | x_n - x_{n+1}| \leq \lambda^n | x_1 - x_0 | \)
  - iter picard: \(x_{n+1} = f(x_n) \)
  - Banach: contractie are pct fix unic care-i lim \(\forall\) iteratii Picard
  - banach convergent - pg 34
* viteza convergenta:
 - ordinul de convergență: \(q\) cel mai mare pt care 
  #+begin_export latex
  \[
\lim\limits_{k\to \infty} \frac{\|x_{n+1} - \bar{x}\|}{\|x_{n} - \bar{x}\|^q} < \infty
  \]
  #+end_export
 - \(q=1\) - conv liniara
 - \(q=2\) - conv patratica
* met newton 
 - mer'e daca \(f \in C^2\) și toate iteratiile au \(f'(x_k) \ne 0\)
 - iteratie newton:
  \[ x_{k+1} = x_k - \frac{f(x_k)}{f'(x_k)} \]
 - converge la zerourile fct
 - to solve linear equation we apply that to \(\nabla L(x, (\lambda, \mu))\)
